Repository: common-repository/keto-calculator
Catalog: languages/keto-calculator-*.po
Languages: ar, fi, nl_nl

source: Activity Level
ar: مستوى النشاط
fi: Aktiivisuustaso
nl_nl: Activiteiten niveau

source: Age
ar: عمر
fi: Ikä
nl_nl: Leeftijd

source: Athlete/Bodybuilder
ar: رياضي / لاعب كمال اجسام
fi: Urheilija / Kehonrakentaja
nl_nl: Atleet / Bodybuilder

source: Based on the amount of net carbs you specified, it would impossible to lose any weight. Please, reduce the amount of net carbs and try again.
ar: بناءً على كمية الكربوهيدرات الصافية التي حددتها ، سيكون من المستحيل فقدان أي وزن. من فضلك ، قلل من كمية الكربوهيدرات الصافية وحاول مرة أخرى.
fi: Määrittämäsi nettohiilihydraattimäärän perusteella ei olisi mahdollista laihtua. Vähennä hiilihydraattien määrää ja yritä uudelleen.
nl_nl: Op basis van de hoeveelheid netto-koolhydraten die u hebt opgegeven, is het onmogelijk om gewicht te verliezen. Verminder alsjeblieft het aantal netto koolhydraten en probeer het opnieuw.

source: Below is a range of calorie deficits to help you lose weight. For best results, it is recommended that you opt for a moderate calorie deficit of 10-20%.
ar: يوجد أدناه مجموعة من عجز السعرات الحرارية لمساعدتك على إنقاص الوزن. للحصول على أفضل النتائج ، يوصى باختيار عجز معتدل في السعرات الحرارية بنسبة 10-20٪.
fi: Alla on valikoima kalorien alijäämiä, joiden avulla voit laihtua. Parhaan tuloksen saavuttamiseksi on suositeltavaa, että valitset maltillisen 10–20%: n kalorien alijäämän.
nl_nl: Hieronder vindt u een reeks calorietekorten om u te helpen gewicht te verliezen. Voor het beste resultaat is het aan te raden om te kiezen voor een matig calorietekort van 10-20%.

source: Below is a range of calorie surpluses to help you bulk up and gain muscle size. Keep in mind that you will need to add physical activity (weight training) in order to increase your muscle mass. For best results, it is recommended that you opt for a moderate calorie surplus of 10-20%.
ar: يوجد أدناه مجموعة من الفائض من السعرات الحرارية لمساعدتك على زيادة الوزن واكتساب حجم العضلات. ضع في اعتبارك أنك ستحتاج إلى إضافة نشاط بدني (تدريب الوزن) لزيادة كتلة عضلاتك. للحصول على أفضل النتائج ، يوصى باختيار فائض متوسط ​​من السعرات الحرارية بنسبة 10-20٪.
fi: Alla on valikoima kaloriylijäämiä, jotka auttavat sinua irtotavarana ja kasvattamaan lihaksen kokoa. Muista, että sinun on lisättävä fyysistä aktiivisuutta (painoharjoittelu), jotta lihassasi kasvaa. Parhaan tuloksen saavuttamiseksi on suositeltavaa, että valitset maltillisen 10–20%: n ylijäämän.
nl_nl: Hieronder vindt u een reeks calorie-overschotten om u te helpen uw spieren op te bouwen en te vergroten. Houd er rekening mee dat je fysieke activiteit (krachttraining) moet toevoegen om je spiermassa te vergroten. Voor het beste resultaat is het aan te raden om te kiezen voor een matig calorie-overschot van 10-20%.

source: Body fat
ar: دهون الجسم
fi: Kehon rasva
nl_nl: Lichaamsvet

source: Calorie adjustment
ar: تعديل السعرات الحرارية
fi: Kalorin säätö
nl_nl: Calorie-aanpassing

source: Calorie surplus
ar: فائض السعرات الحرارية
fi: Kaloriylijäämä
nl_nl: Calorie-overschot

source: Calories to consume
ar: استهلاك السعرات الحرارية
fi: Kulutettavat kalorit
nl_nl: Calorieën om te consumeren

source: Calories to consume:
ar: السعرات الحرارية التي يجب استهلاكها:
fi: Kulutettavat kalorit:
nl_nl: Calorieën om te consumeren:

source: Custom
ar: مخصص
fi: Mukautettu
nl_nl: Op maat

source: Custom adjustment
ar: تعديل مخصص
fi: Mukautettu säätö
nl_nl: Calorie-aanpassing

source: Enter the calorie intake adjustment. For a calorie deficit (weight loss) enter a negative value (e.g. -10) while for a calorie surplus (weight gain) enter a positive value (e.g. 15).
ar: أدخل تعديل تناول السعرات الحرارية. بالنسبة لعجز السعرات الحرارية (فقدان الوزن) ، أدخل قيمة سالبة (على سبيل المثال -10) بينما أدخل فائضًا في السعرات الحرارية (زيادة الوزن) (مثل 15).
fi: Syötä kalorimäärän säätö. Kalorivajeen (painonpudotuksen) arvo on negatiivinen (esim. -10), kun taas kaloriylijäämän (painonlisäys) positiivinen arvo (esim. 15).
nl_nl: Voer de aanpassing van de calorie-inname in. Voer voor een calorietekort (gewichtsverlies) een negatieve waarde in (bijv. -10) en voor een calorie-overschot (gewichtstoename) een positieve waarde (bijvoorbeeld 15).

source: Fat
ar: سمين
fi: rasva
nl_nl: Vet

source: Female
ar: أنثى
fi: Nainen
nl_nl: Vrouw

source: Gender
ar: جنس
fi: sukupuoli
nl_nl: Geslacht

source: Goal
ar: هدف
fi: Päämäärä
nl_nl: Doel

source: grams
ar: جرامات
fi: grammaa
nl_nl: gram

source: Height
ar: ارتفاع
fi: Korkeus
nl_nl: Hoogte

source: It is recommended that you opt for a moderate calorie deficit or surplus.
ar: من المستحسن أن تختار العجز أو الفائض المعتدل من السعرات الحرارية.
fi: On suositeltavaa, että valitset maltillisen kalorien alijäämän tai ylijäämän.
nl_nl: Het is aan te raden om te kiezen voor een matig calorietekort of een overschot.

source: kcal
ar: سعر حراري

source: Keto Calculator
ar: حاسبة كيتو

source: Keto Calculator is a simple calculator, which is used to measure your nutritional needs on a ketogenic diet. It helps users achieve their goal of healing, weight loss, performance and more.
ar: Keto Calculator هي آلة حاسبة بسيطة تستخدم لقياس احتياجاتك الغذائية على نظام غذائي الكيتون. يساعد المستخدمين على تحقيق هدفهم المتمثل في الشفاء وفقدان الوزن والأداء والمزيد.
fi: Keto Laskin on yksinkertainen laskin, jota käytetään mittaamaan ravintotarpeitasi ketogeenisessä ruokavaliossa. Se auttaa käyttäjiä saavuttamaan parantamistavoitteensa, laihtuminen, suorituksen ja muut.
nl_nl: Keto Calculator is een eenvoudige rekenmachine die wordt gebruikt om uw voedingsbehoeften op een ketogeen dieet te meten. Het helpt gebruikers hun doel van genezing, gewichtsverlies, prestaties en meer te bereiken.

source: Large calorie deficit
ar: عجز كبير في السعرات الحرارية
fi: Suuri kalorivaje
nl_nl: Snel afvallen

source: Lightly active
ar: نشط طفيفة
fi: Kevyesti aktiivinen
nl_nl: Lichtelijk actief

source: Maintenance
ar: اعمال صيانة
fi: ylläpito
nl_nl: Onderhoud

source: Maintenance level is the level at which your weight remains stable.
ar: مستوى الصيانة هو المستوى الذي يظل فيه وزنك ثابتًا.
fi: Ylläpitotaso on taso, jolla paino pysyy vakaana.
nl_nl: Onderhoudsniveau is het niveau waarop uw gewicht stabiel blijft.

source: Male
ar: الذكر
fi: Uros
nl_nl: Man

source: meters (e.g. 1.76 meters = 176 cm)
ar: أمتار (مثل 1.76 متر = 176 سم)
fi: metriä (esim. 1,76 metriä = 176 cm)
nl_nl: meter (bijv. 1,76 meter = 176 cm)

source: Metric
ar: قياس
fi: Metrinen
nl_nl: Metriek

source: Moderate calorie deficit
ar: عجز السعرات الحرارية المعتدل
fi: Kohtalainen kalorivaje
nl_nl: Gemiddeld snel afvallen

source: Moderately active
ar: نشط إلى حد ما
fi: Kohtalaisen aktiivinen
nl_nl: Redelijk actief

source: Net Carbs
ar: صافي الكربوهيدرات
fi: Nettohiilihydraatit
nl_nl: Koolhydraten

source: Net carbs
ar: صافي الكربوهيدرات
fi: Nettohiilihydraatit
nl_nl: Koolhydraten

source: Protein
ar: بروتين
fi: proteiini
nl_nl: Eiwit

source: Results
ar: النتائج
fi: tulokset
nl_nl: Resultaten

source: Sedentary
ar: المستقرة
fi: istuma-
nl_nl: Niet actief

source: Small calorie deficit
ar: عجز صغير في السعرات الحرارية
fi: Pieni kalorivaje
nl_nl: Langzaam afvallen

source: Sorry, cannot offer any weight loss suggestions. Please use the Custom section for weight loss macro targets.
ar: عذرا ، لا يمكن أن تقدم أي اقتراحات لفقدان الوزن. يرجى استخدام القسم المخصص لأهداف الماكرو لفقدان الوزن.
fi: Valitettavasti ei voi tarjota painonpudotusta koskevia ehdotuksia. Käytä Mukautettu-osaa painonpudotuksen makrokohteisiin.
nl_nl: Sorry, ik kan geen suggesties voor gewichtsverlies aanbieden. Gebruik de aangepaste sectie voor macrodoelen voor gewichtsverlies.

source: Specify the amount of daily net carbs you'd like to consume. Typically, 20-30 grams is recommended to start with.
ar: حدد كمية الكربوهيدرات الصافية اليومية التي ترغب في تناولها. عادة ، يوصى بـ 20-30 جرامًا للبدء.
fi: Määritä päivittäinen nettohiilihydraattien määrä, jonka haluat kuluttaa. Tyypillisesti suositellaan alkamaan 20-30 grammaa.
nl_nl: Geef het aantal dagelijkse netto-koolhydraten op dat u wilt consumeren. Meestal wordt 20-30 gram aanbevolen om mee te beginnen.

source: Units
ar: الوحدات
fi: yksiköt
nl_nl: Eenheden

source: US Customary
ar: العرفي الأمريكي
fi: Yhdysvaltain tavanomainen
nl_nl: Amerikaanse gewoonte

source: Very active
ar: نشيط جدا
fi: Todella aktiivinen
nl_nl: Heel actief

source: Weight
ar: وزن
fi: Paino
nl_nl: Gewicht

source: Weight gain
ar: زيادة الوزن
fi: Painonnousu
nl_nl: Gewichtstoename

source: Weight loss
ar: فقدان الوزن
fi: Painonpudotus
nl_nl: Gewichtsverlies

source: years
ar: سنوات
fi: vuotta
nl_nl: jaar

source: Your BMR is
ar: BMR الخاص بك هو
fi: Sinun BMR on
nl_nl: Je BMR is

source: Your BMR is:
ar: BMR الخاص بك هو:
fi: Sinun BMR on:
nl_nl: Je BMR is:

source: Your body fat is too low. You should have a minimum of <span class="kdbEssentialFat">3</span>% body fat (essential fat you cannot lose). <em>It is not advisable for you to lose any more weight.
ar: الدهون في الجسم منخفضة للغاية. يجب أن يكون لديك <span class = "kdbEssentialFat"> 3 </span>٪ على الأقل من الدهون في الجسم (الدهون الأساسية التي لا يمكن أن تفقدها). <em> ليس من المستحسن أن تخسر المزيد من الوزن.
fi: Kehosi rasva on liian alhainen. Sinulla tulisi olla vähintään <span class = "kdbEssentialFat"> 3 </span>% rasvaa (välttämätöntä rasvaa, jota et voi menettää). <em> Ei ole suositeltavaa laihtua enemmän.
nl_nl: Je lichaamsvet is te laag. U moet minimaal <span class = "kdbEssentialFat"> 3 </span> lichaamsvet hebben (essentieel vet dat u niet kunt verliezen). <em> Het is niet aan te raden om meer af te vallen.

source: Your fat intake should be
ar: يجب أن يكون تناول الدهون الخاصة بك
fi: Rasvan saannin tulisi olla
nl_nl: Je vetinname zou moeten zijn

source: Your fat intake should be:
ar: يجب أن يكون تناول الدهون:
fi: Rasvan saannin tulisi olla:
nl_nl: Je vetinname moet zijn:

source: Your net carbs intake is:
ar: صافي استهلاكك من الكربوهيدرات هو:
fi: Nettohiilihydraattien saanti on:
nl_nl: Je netto-inname van koolhydraten is:
